{
  "products": [
    {
      "id": 1,
      "name": "Silent Hill 2 Zippo Flip Lighter",
      "originalPrice": 30,
      "salePrice": null,
      "description": "Street chrome Zippo featuring Pyramid Head and Bubble Head Nurse designs on either side with the iconic Silent Hill 2 logo. Premium chrome finish with legendary horror imagery.",
      "longDescription": "A stunning street chrome Zippo lighter showcasing the most iconic creatures from Silent Hill 2. One side features the menacing Pyramid Head while the other displays the haunting Bubble Head Nurse, with the distinctive Silent Hill 2 logo completing this collector's masterpiece. The premium chrome finish provides a brilliant backdrop for these legendary horror designs from James Sunderland's psychological nightmare. Built with Zippo's legendary reliability and windproof design for horror fans and collectors alike.",
      "images": [
        "images/001_silent_hill_2_zippo_lighter_1.webp",
        "images/001_silent_hill_2_zippo_lighter_2.webp",
        "images/001_silent_hill_2_zippo_lighter_3.webp"
      ],
      "category": "gaming",
      "type": "lighter",
      "color": "chrome",
      "theme": "horror",
      "inStock": true,
      "barcode": "images/barcodes/001.jpeg"
    },
    {
      "id": 2,
      "name": "Aphex Twin Logo Zippo Flip Lighter",
      "originalPrice": 30,
      "salePrice": null,
      "description": "Rare Aphex Twin electronic music themed Zippo with distinctive IDM artwork. Features the iconic ambient techno artist's signature aesthetic.",
      "longDescription": "Celebrate the genius of Richard D. James with this exclusive Aphex Twin Zippo lighter. Showcasing the distinctive visual style associated with the legendary electronic music producer, this lighter is a must-have for fans of intelligent dance music and experimental electronica. The design captures the essence of Aphex Twin's innovative sound with striking visuals that reflect his influential career spanning ambient, acid, and IDM genres. Built with Zippo's legendary quality and lifetime guarantee.",
      "images": [
        "images/002_aphex_twin_zippo_lighter_1.webp",
        "images/002_aphex_twin_zippo_lighter_2.webp",
        "images/002_aphex_twin_zippo_lighter_3.webp"
      ],
      "category": "music",
      "type": "lighter",
      "color": "chrome",
      "theme": "electronic",
      "inStock": true,
      "barcode": "images/barcodes/002.jpeg"
    },
    {
      "id": 3,
      "name": "Silent Hill 3 Zippo Flip Lighter",
      "originalPrice": 30,
      "salePrice": null,
      "description": "Street chrome Zippo featuring the beautiful Silent Hill 3 logo and iconic Robbie the Rabbit. Premium chrome finish with haunting game imagery.",
      "longDescription": "A stunning street chrome Zippo lighter showcasing the beautiful Silent Hill 3 logo alongside the iconic and unsettling Robbie the Rabbit. The premium chrome finish provides a sleek backdrop for the haunting imagery from Konami's psychological horror masterpiece. This collector's piece captures the eerie atmosphere of Heather Mason's journey with detailed artwork that Silent Hill fans will instantly recognize. Built with Zippo's legendary reliability and windproof design.",
      "images": [
        "images/003_silent_hill_3_zippo_lighter_1.webp",
        "images/003_silent_hill_3_zippo_lighter_2.webp",
        "images/003_silent_hill_3_zippo_lighter_3.webp"
      ],
      "category": "gaming",
      "type": "lighter",
      "color": "chrome",
      "theme": "horror",
      "inStock": true,
      "barcode": "images/barcodes/003.jpeg"
    },
    {
      "id": 4,
      "name": "Elder Scrolls Skyrim Zippo Flip Lighter",
      "originalPrice": 25,
      "salePrice": null,
      "description": "Minimalist Skyrim Zippo featuring the iconic Elder Scrolls V logo. Clean design showcasing the classic dragon emblem.",
      "longDescription": "A sleek tribute to Elder Scrolls V: Skyrim featuring the game's distinctive logo in a clean, minimalist design. This high-quality lighter showcases the iconic Skyrim dragon emblem without unnecessary clutter, letting the legendary symbol speak for itself. While not a Zippo brand lighter, this exceptional quality alternative offers the same reliable windproof performance and durable construction. Perfect for fans who appreciate understated elegance and the timeless appeal of one of gaming's most beloved RPGs.",
      "images": [
        "images/004_elder_scrolls_skyrim_zippo_lighter_1.webp",
        "images/004_elder_scrolls_skyrim_zippo_lighter_2.webp",
        "images/004_elder_scrolls_skyrim_zippo_lighter_3.webp"
      ],
      "category": "gaming",
      "type": "lighter",
      "color": "black",
      "theme": "fantasy",
      "inStock": true,
      "barcode": "images/barcodes/004.jpeg"
    },
    {
      "id": 5,
      "name": "Elder Scrolls Oblivion Zippo Flip Lighter",
      "originalPrice": 25,
      "salePrice": null,
      "description": "Oblivion-themed Zippo featuring the iconic Elder Scrolls IV logo. Clean design showcasing the classic Oblivion emblem.",
      "longDescription": "A sleek tribute to Elder Scrolls IV: Oblivion featuring the game's distinctive logo in a clean, minimalist design. This high-quality lighter showcases the iconic Oblivion emblem without unnecessary clutter, letting the legendary symbol speak for itself. While not a Zippo brand lighter, this exceptional quality alternative offers the same reliable windproof performance and durable construction. Perfect for fans who appreciate understated elegance and the timeless appeal of one of gaming's most beloved RPGs.",
      "images": [
        "images/005_elder_scrolls_oblivion_zippo_lighter_1.webp",
        "images/005_elder_scrolls_oblivion_zippo_lighter_2.webp",
        "images/005_elder_scrolls_oblivion_zippo_lighter_3.webp"
      ],
      "category": "gaming",
      "type": "lighter",
      "color": "black",
      "theme": "fantasy",
      "inStock": true,
      "barcode": "images/barcodes/005.jpeg"
    },
    {
      "id": 7,
      "name": "Need Head Blown Off Stick Figure Zippo Flip Lighter",
      "originalPrice": 25,
      "salePrice": null,
      "description": "Edgy stick figure Zippo with bold graphic design. Features striking artwork for those who prefer darker aesthetic themes.",
      "longDescription": "Make a bold statement with this striking stick figure-themed lighter. Featuring provocative artwork and edgy design elements, this lighter is perfect for those who appreciate darker aesthetic themes and aren't afraid to stand out. The detailed graphics showcase goofy, nostalgic stick figure imagery with bold typography that demands attention. While not a Zippo brand lighter, this exceptional quality alternative offers the same reliable windproof performance and durable construction, combining rebellious style with dependable performance.",
      "images": [
        "images/007_need_head_blown_off_zippo_lighter_1.webp",
        "images/007_need_head_blown_off_zippo_lighter_2.webp",
        "images/007_need_head_blown_off_zippo_lighter_3.webp"
      ],
      "category": "original",
      "type": "lighter",
      "color": "black",
      "theme": "funny",
      "inStock": true,
      "barcode": "images/barcodes/007.jpg"
    }
  ],
  "sales": [
    {
      "id": "sale_1750424839978",
      "name": "LIGHTER",
      "description": "25% off Chrome Lighters",
      "active": true,
      "percentage": 25,
      "criteria": {
        "color": "chrome"
      },
      "startDate": "2025-06-20",
      "endDate": "2025-08-20"
    }
  ]
}